c16/esp32c3/sdkconfig.defaults
# ESP32-C3 Bare Metal Configuration
CONFIG_IDF_TARGET="esp32c3"

# Serial flasher config
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Compiler options - optimize for size
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y

# Boot and startup
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOT_ROM_LOG_ALWAYS_OFF=y

# Minimal FreeRTOS (ESP-IDF requires it for startup, but we don't use it)
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=y
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_NONE=y

# Disable unnecessary features to minimize code size
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE=8
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=1024

# Disable logging (bare metal - no printf overhead)
CONFIG_LOG_DEFAULT_LEVEL_NONE=y

# CPU and clock
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# Minimal memory
CONFIG_ESP_SYSTEM_MEMPROT_FEATURE=n
